golf2109/STM32F746IG-StemWin-800x480/Src/main.c
  /* Step 3: Configure a PALL (precharge all) command */ 
  Command.CommandMode            = FMC_SDRAM_CMD_PALL;
//  Command.CommandTarget          = FMC_SDRAM_CMD_TARGET_BANK2;
  Command.AutoRefreshNumber      = 1;
  Command.ModeRegisterDefinition = 0;
  /* Send the command */
  HAL_SDRAM_SendCommand(&hsdram1, &Command, SDRAM_TIMEOUT);  
  
  /* Step 4: Configure an Auto Refresh command */ 
  Command.CommandMode            = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
//  Command.CommandTarget          = FMC_SDRAM_CMD_TARGET_BANK2;
  Command.AutoRefreshNumber      = 8;
  Command.ModeRegisterDefinition = 0;
  /* Send the command */
  HAL_SDRAM_SendCommand(&hsdram1, &Command, SDRAM_TIMEOUT);
  
  /* Step 5: Program the external memory mode register */
  tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1          |\
                     SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL   |\
                     SDRAM_MODEREG_CAS_LATENCY_3           |\
                     SDRAM_MODEREG_OPERATING_MODE_STANDARD |\
                     SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;
  
  Command.CommandMode            = FMC_SDRAM_CMD_LOAD_MODE;
//  Command.CommandTarget          = FMC_SDRAM_CMD_TARGET_BANK2;
  Command.AutoRefreshNumber      = 1;
  Command.ModeRegisterDefinition = tmpmrd;
  /* Send the command */
  HAL_SDRAM_SendCommand(&hsdram1, &Command, SDRAM_TIMEOUT);
  
  /* Step 6: Set the refresh rate counter */
  /* Set the device refresh rate */
  HAL_SDRAM_ProgramRefreshRate(&hsdram1, REFRESH_COUNT); 
}

int APP_GetData(void * p, const U8 **ppData, unsigned NumBytesReq, U32 Off){
	//You must create an pointer on structure
	FIL *phFile;
	//and then initialize the pointer value is passed to the function APP_GetData
	phFile=(FIL*) p;
	//And then use this pointer to your function
	f_lseek(phFile,Off);
	fresult=f_read(phFile,_acBuffer,NumBytesReq,(void*)&bytesread);
	*ppData = _acBuffer;
	return bytesread;
}


void picture_test(void){
		
	for(image_number = 1; image_number <= 22;image_number++){
		sprintf(st_2,"image%03d",image_number);
		sprintf(file_name, "%s%s",st_2,st_3 );			
		fresult=f_open(&MyFile,file_name, FA_READ);
//		GUI_MULTIBUF_BeginEx(0);	
		GUI_BMP_DrawEx(APP_GetData, &MyFile,0,0); // Draw image
//		GUI_MULTIBUF_EndEx(0);
		f_close(&MyFile);
		HAL_Delay(1000);	
	}	
}


void picture_test_irq(void){
uint32_t prim;	
	
	for(image_number = 1; image_number <= 2;image_number++){
		sprintf(st_2,"image%03d",image_number);
		sprintf(file_name, "%s%s",st_2,st_3 );			
		fresult=f_open(&MyFile,file_name, FA_READ);
//		GUI_MULTIBUF_BeginEx(0);
			prim = __get_PRIMASK();
			__disable_irq();		
		GUI_BMP_DrawEx(APP_GetData, &MyFile,0,0); // Draw image
		if (!prim) {
			__enable_irq();
    }		
//		GUI_MULTIBUF_EndEx(0);
		f_close(&MyFile);
		HAL_Delay(1000);	
	}	
					
	for(image_number = 1; image_number <= 22;image_number++){
		sprintf(st_2,"image%03d",image_number);
		sprintf(file_name, "%s%s",st_2,st_3 );			
		fresult=f_open(&MyFile,file_name, FA_READ);
		GUI_MULTIBUF_BeginEx(0);
			prim = __get_PRIMASK();
			__disable_irq();		
		GUI_BMP_DrawEx(APP_GetData, &MyFile,0,0); // Draw image
		if (!prim) {
			__enable_irq();
    }		
		GUI_MULTIBUF_EndEx(0);
		f_close(&MyFile);
		HAL_Delay(1000);	
	}				
}
uint8_t CheckForUserInput(void){
 if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_7) != GPIO_PIN_RESET)
 {
   HAL_Delay(10);
   while (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_7) != GPIO_PIN_RESET);
   return 1 ;
 }
 return 0;
}

void touch_test(void){
	while (CheckForUserInput()==0)
	{
		TS_GetState(&TS_State);
		if(TS_State.touchDetected)
		{
			x = TS_State.touchX[0];
			y = TS_State.touchY[0];
//			TFT_SetFont(&Font20);
//			TFT_SetTextColor(LCD_COLOR_CYAN);
//			TFT_SetBackColor(LCD_COLOR_BLACK);
			GUI_SetFont(&GUI_Font8x16);
			if(tscnt[0]>0)
			{
//				TFT_DrawLine(xstart[0],ystart[0],x,y,LCD_COLOR_RED);
			  GUI_DrawLine(xstart[0],ystart[0],x,y);				
			}
			else
			{
//				TFT_DrawPixel(x,y,LCD_COLOR_RED);
				GUI_DrawPixel(x,y);
			}
			xstart[0]=x; ystart[0]=y;
			tscnt[0]++;
			sprintf(str1,"1: x=%03d; y=%03d",x,y);
//			TFT_DisplayString(14, 50, (uint8_t *)str1, LEFT_MODE);
			GUI_DispStringAt(str1, 14, 50);
			if (TS_State.touchDetected >= 2)
			{
				x = TS_State.touchX[1];
				y = TS_State.touchY[1];
				if(tscnt[1]>0)
				{
//				  TFT_DrawLine(xstart[1],ystart[1],x,y,LCD_COLOR_GREEN);
					GUI_DrawLine(xstart[1],ystart[1],x,y);
				}
				else
				{
//				  TFT_DrawPixel(x,y,LCD_COLOR_GREEN);
				GUI_DrawPixel(x,y);					
				}
				xstart[1]=x; ystart[1]=y;
				tscnt[1]++;
				sprintf(str1, "2: x=%03d; y=%03d", x, y);
//				TFT_DisplayString(14, 80, (uint8_t *)str1, LEFT_MODE);
			GUI_DispStringAt(str1, 14, 80);				
			}
			else
			{
//				TFT_FillRectangle(14,80,250,109,LCD_COLOR_BLACK);
				GUI_DrawRect(14,80,250,109);
			}
			if (TS_State.touchDetected >= 3)
			{
				x = TS_State.touchX[2];
				y = TS_State.touchY[2];
				if(tscnt[2]>0)
				{
//				  TFT_DrawLine(xstart[2],ystart[2],x,y,LCD_COLOR_YELLOW);
					GUI_DrawLine(xstart[2],ystart[2],x,y);					
				}
				else
				{
//				  TFT_DrawPixel(x,y,LCD_COLOR_YELLOW);
				GUI_DrawPixel(x,y);					
				}
				xstart[2]=x; ystart[2]=y;
				tscnt[2]++;
				sprintf(str1, "3: x=%03d; y=%03d", x, y);
//				TFT_DisplayString(14, 110, (uint8_t *)str1, LEFT_MODE);
			GUI_DispStringAt(str1, 14, 110);				
			}
			else
			{
//				TFT_FillRectangle(14,110,250,139,LCD_COLOR_BLACK);
				GUI_DrawRect(14,110,250,139);				
			}
			if (TS_State.touchDetected >= 4)
			{
				x = TS_State.touchX[3];
				y = TS_State.touchY[3];
				if(tscnt[3]>0)
				{
//				  TFT_DrawLine(xstart[3],ystart[3],x,y,LCD_COLOR_ORANGE);
					GUI_DrawLine(xstart[3],ystart[3],x,y);						
				}
				else
				{
//				  TFT_DrawPixel(x,y,LCD_COLOR_ORANGE);
				GUI_DrawPixel(x,y);					
				}
				xstart[3]=x; ystart[3]=y;
				tscnt[3]++;
				sprintf(str1, "4: x=%03d; y=%03d", x, y);
//				TFT_DisplayString(14, 140, (uint8_t *)str1, LEFT_MODE);
			GUI_DispStringAt(str1, 14, 140);				
			}
			else
			{
//				TFT_FillRectangle(14,140,250,169,LCD_COLOR_BLACK);
				GUI_DrawRect(14,140,250,169);				
			}
			if (TS_State.touchDetected >= 5)
			{
				x = TS_State.touchX[4];
				y = TS_State.touchY[4];
				if(tscnt[4]>0)
				{
//				  TFT_DrawLine(xstart[4],ystart[4],x,y,LCD_COLOR_BLUE);
					GUI_DrawLine(xstart[4],ystart[4],x,y);						
				}
				else
				{
//				  TFT_DrawPixel(x,y,LCD_COLOR_BLUE);
				GUI_DrawPixel(x,y);					
				}
				xstart[4]=x; ystart[4]=y;
				tscnt[4]++;
				sprintf(str1, "5: x=%03d; y=%03d", x, y);
//				TFT_DisplayString(14, 170, (uint8_t *)str1, LEFT_MODE);
			}
			else
			{
//				TFT_FillRectangle(14,170,250,199,LCD_COLOR_BLACK);
				GUI_DrawRect(14,170,250,199);				
			}
		}
		else
		{
			tscnt[0]=0;tscnt[1]=0;tscnt[2]=0;tscnt[3]=0;tscnt[4]=0;
		}
		HAL_Delay(10);
	}
}

uint32_t OpenBMP(uint8_t *ptr, const char* fname)
{
	uint32_t ind=0,sz=0,i1=0,ind1=0;
	static uint32_t bmp_addr;
	if(f_open(&MyFile,fname,FA_READ)!=FR_OK)
	{
//		  TFT_FillScreen(0xFF00FF00); //в случае неудачи окрасим экран в красный цвет
	}
	else
	{
		if(f_read(&MyFile,sect,30,(UINT *)&bytesread)!=FR_OK)
		{
			Error_Handler();
		}
		else
		{
			bmp_addr=(uint32_t)sect;
			/*Get bitmap size*/
			sz=*(uint16_t*)(bmp_addr + 2);
			sz|=(*(uint16_t*)(bmp_addr + 4))<<16;
			/*Get bitmap data address offset*/
			ind=*(uint16_t*)(bmp_addr + 10);
			ind|=(*(uint16_t*)(bmp_addr + 12))<<16;
			f_close(&MyFile);
			f_open(&MyFile,fname,FA_READ);
			ind=0;
			do
			{
				if(sz<512)
				{
					i1=sz;
				}
				else
				{
					i1=512;
				}
				sz-=i1;
				f_lseek(&MyFile,ind1);
				f_read(&MyFile,sect,i1,(UINT *)&bytesread);
				memcpy((void*)(bmp1+ind1),(void*)sect,i1);
				ind1+=i1;
			}
			while(sz>0);
			f_close(&MyFile);
		}
		ind1=0;
	}
	return 0;
}

