golf2109/STM32F746IG-StemWin-800x480/Src/main.c
uint8_t hex_char (uint8_t dig){
uint8_t q;
q = 0xf & dig;
if (q <=0x9){q=0x30|q;}
else{
  switch(q)
  {
    case 0x0a:
      q=0x41;
    break;
    case 0x0b:
      q=0x42;
    break;
    case 0x0c:
      q=0x43;
    break;
    case 0x0d:
      q=0x44;
    break;
    case 0x0e:
      q=0x45;
    break;  
    case 0x0f:
      q=0x46;
    break;     
  }
}  
return q;
}

void	my_touch_test(void){
if(touch_enable ==1){
  
device_mode = touch_receive[0x00]; 
gesture_id = touch_receive[0x01];
number_of_tuchpoint = touch_receive[0x02];    
 
y_circle_position[0]=800*(256*(0x0F & (touch_receive[0x03])) + touch_receive[0x04])/1791;
x_circle_position[0]=480*(256*(0x0F & (touch_receive[0x05])) + touch_receive[0x06])/1024;
y_circle_position[1]=800*(256*(0x0F & (touch_receive[0x09])) + touch_receive[0x0a])/1791;
x_circle_position[1]=480*(256*(0x0F & (touch_receive[0x0b])) + touch_receive[0x0c])/1024;  
y_circle_position[2]=800*(256*(0x0F & (touch_receive[0x0f])) + touch_receive[0x10])/1791;
x_circle_position[2]=480*(256*(0x0F & (touch_receive[0x11])) + touch_receive[0x12])/1024;  
y_circle_position[3]=800*(256*(0x0F & (touch_receive[0x15])) + touch_receive[0x16])/1791;
x_circle_position[3]=480*(256*(0x0F & (touch_receive[0x17])) + touch_receive[0x18])/1024;  
y_circle_position[4]=800*(256*(0x0F & (touch_receive[0x1b])) + touch_receive[0x1c])/1791;
x_circle_position[4]=480*(256*(0x0F & (touch_receive[0x1d])) + touch_receive[0x1e])/1024;  

y_pos[0]=256*(0x0F & (touch_receive[0x03])) + touch_receive[0x04];
x_pos[0]=256*(0x0F & (touch_receive[0x05])) + touch_receive[0x06];
y_pos[1]=256*(0x0F & (touch_receive[0x09])) + touch_receive[0x0a];
x_pos[1]=256*(0x0F & (touch_receive[0x0b])) + touch_receive[0x0c];  
y_pos[2]=256*(0x0F & (touch_receive[0x0f])) + touch_receive[0x10];
x_pos[2]=256*(0x0F & (touch_receive[0x11])) + touch_receive[0x12];  
y_pos[3]=256*(0x0F & (touch_receive[0x15])) + touch_receive[0x16];
x_pos[3]=256*(0x0F & (touch_receive[0x17])) + touch_receive[0x18];  
y_pos[4]=256*(0x0F & (touch_receive[0x1b])) + touch_receive[0x1c];
x_pos[4]=256*(0x0F & (touch_receive[0x1d])) + touch_receive[0x1e]; 

//================================================================
t0 =(hex_char(device_mode >> 12));
uart_TX[0] = t0;
t1 =(hex_char(device_mode >>  8));
uart_TX[1] = t1;
t2 =(hex_char(device_mode >>  4));    
uart_TX[2] = t2;
t3 =(hex_char(device_mode >>  0)); 
uart_TX[3] = t3;
uart_TX[4] = 0x2c;;
//TFT_Draw_Char(210,10,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,210,10);
//TFT_Draw_Char(230,10,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,230,10);
//TFT_Draw_Char(250,10,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,250,10);
//TFT_Draw_Char(270,10,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2); 
GUI_DispCharAt(t3,270,10);

//================================================================

t0 =(hex_char(gesture_id >> 12));
uart_TX[5] = t0;
t1 =(hex_char(gesture_id >>  8));
uart_TX[6] = t1;
t2 =(hex_char(gesture_id >>  4));    
uart_TX[7] = t2;
t3 =(hex_char(gesture_id >>  0)); 
uart_TX[8] = t3;
uart_TX[9] = 0x2c;
//TFT_Draw_Char(310,10,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,310,10);
//TFT_Draw_Char(330,10,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,330,10);
//TFT_Draw_Char(350,10,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,350,10);
//TFT_Draw_Char(370,10,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);
GUI_DispCharAt(t3,370,10);

//================================================================
t0 =(hex_char(number_of_tuchpoint >> 12));
uart_TX[0x0a] = t0;
t1 =(hex_char(number_of_tuchpoint >>  8));
uart_TX[0x0b] = t1;
t2 =(hex_char(number_of_tuchpoint >>  4));    
uart_TX[0x0c] = t2;
t3 =(hex_char(number_of_tuchpoint >>  0)); 
uart_TX[0x0d] = t3;
uart_TX[0x0e] = 0x2c;
//TFT_Draw_Char(410,10,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,410,10);
//TFT_Draw_Char(430,10,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,430,10);
//TFT_Draw_Char(450,10,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,450,10);
//TFT_Draw_Char(470,10,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2); 
GUI_DispCharAt(t3,470,10);

//=================================================================
///////////////////////////////////////////////////////////////////
t0 =(hex_char((y_pos[0]) >> 12));
uart_TX[0x0f] = t0;
t1 =(hex_char((y_pos[0]) >>  8));
uart_TX[0x10] = t1;
t2 =(hex_char((y_pos[0]) >>  4));   
uart_TX[0x11] = t2;
t3 =(hex_char((y_pos[0]) >>  0));    
uart_TX[0x12] = t3;
uart_TX[0x13] = 0x2c;
//TFT_Draw_Char(10,30,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,10,30);
//TFT_Draw_Char(30,30,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,30,30);
//TFT_Draw_Char(50,30,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,50,30);
//TFT_Draw_Char(70,30,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);     
GUI_DispCharAt(t3,70,30);
t0 =(hex_char((x_pos[0]) >> 12));
uart_TX[0x14] = t0;
t1 =(hex_char((x_pos[0]) >>  8));
uart_TX[0x15] = t1;
t2 =(hex_char((x_pos[0]) >>  4));    
uart_TX[0x16] = t2;
t3 =(hex_char((x_pos[0]) >>  0));    
uart_TX[0x17] = t3;
uart_TX[0x18] = 0x2c;
//TFT_Draw_Char(110,30,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,110,30);
//TFT_Draw_Char(130,30,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,130,30);
//TFT_Draw_Char(150,30,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,150,30);
//TFT_Draw_Char(170,30,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);      
GUI_DispCharAt(t3,170,30);
//
event_flag[0] = touch_receive[0x03];
touch_id[0] = touch_receive[0x05];
t0 =(hex_char((event_flag[0]) >> 6));
uart_TX[0x19] = t0;
t1 =(hex_char((touch_id[0]) >>  4));   
uart_TX[0x1a] = t1;
uart_TX[0x1b] = 0x2c;
//TFT_Draw_Char(270,30,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,270,30);
//TFT_Draw_Char(370,30,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,370,30);
//----------------------------------------------------------------
t0 =(hex_char((y_pos[1]) >> 12));
uart_TX[0x1c] = t0;
t1 =(hex_char((y_pos[1]) >>  8));
uart_TX[0x1d] = t1;
t2 =(hex_char((y_pos[1]) >>  4));    
uart_TX[0x1e] = t2;
t3 =(hex_char((y_pos[1]) >>  0));    
uart_TX[0x1f] = t3;
uart_TX[0x20] = 0x2c;
//TFT_Draw_Char(10,50,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,10,50);
//TFT_Draw_Char(30,50,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,30,50);
//TFT_Draw_Char(50,50,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,50,50);
//TFT_Draw_Char(70,50,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);     
GUI_DispCharAt(t3,70,50);
t0 =(hex_char((x_pos[1]) >> 12));
uart_TX[0x21] = t0;
t1 =(hex_char((x_pos[1]) >>  8));
uart_TX[0x22] = t1;
t2 =(hex_char((x_pos[1]) >>  4));    
uart_TX[0x23] = t2;
t3 =(hex_char((x_pos[1]) >>  0));    
uart_TX[0x24] = t3;
uart_TX[0x25] = 0x2c;
//TFT_Draw_Char(110,50,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,110,50);
//TFT_Draw_Char(130,50,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,130,50);
//TFT_Draw_Char(150,50,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,150,50);
//TFT_Draw_Char(170,50,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);   
GUI_DispCharAt(t3,170,50);
//
event_flag[1] = touch_receive[0x09];
touch_id[1] = touch_receive[0x0b];
t0 =(hex_char((event_flag[1]) >> 6));
uart_TX[0x26] = t0;
t1 =(hex_char((touch_id[1]) >>  4));   
uart_TX[0x27] = t1;
uart_TX[0x28] = 0x2c;
//TFT_Draw_Char(270,50,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,270,50);
//TFT_Draw_Char(370,50,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,370,50);
//----------------------------------------------------------------
t0 =(hex_char((y_pos[2]) >> 12));
uart_TX[0x29] = t0;
t1 =(hex_char((y_pos[2]) >>  8));
uart_TX[0x2a] = t1;
t2 =(hex_char((y_pos[2]) >>  4));    
uart_TX[0x2b] = t2;
t3 =(hex_char((y_pos[2]) >>  0));    
uart_TX[0x2c] = t3;
uart_TX[0x2d] = 0x2c;
//TFT_Draw_Char(10,70,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,10,70);
//TFT_Draw_Char(30,70,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,30,70);
//TFT_Draw_Char(50,70,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,50,70);
//TFT_Draw_Char(70,70,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);     
GUI_DispCharAt(t3,70,70);
t0 =(hex_char((x_pos[2]) >> 12));
uart_TX[0x2e] = t0;
t1 =(hex_char((x_pos[2]) >>  8));
uart_TX[0x2f] = t1;
t2 =(hex_char((x_pos[2]) >>  4));    
uart_TX[0x30] = t2;
t3 =(hex_char((x_pos[2]) >>  0));    
uart_TX[0x31] = t3;
uart_TX[0x32] = 0x2c;
//TFT_Draw_Char(110,70,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,110,70);
//TFT_Draw_Char(130,70,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,130,70);
//TFT_Draw_Char(150,70,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,150,70);
//TFT_Draw_Char(170,70,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2); 
GUI_DispCharAt(t3,170,70);
//
event_flag[2] = touch_receive[0x0f];
touch_id[2] = touch_receive[0x11];
t0 =(hex_char((event_flag[2]) >> 6));
uart_TX[0x33] = t0;
t1 =(hex_char((touch_id[2]) >>  4));   
uart_TX[0x34] = t1;
uart_TX[0x35] = 0x2c;
//TFT_Draw_Char(270,70,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,270,70);
//TFT_Draw_Char(370,70,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,370,70);
//----------------------------------------------------------------

t0 =(hex_char((y_pos[3]) >> 12));
uart_TX[0x36] = t0;
t1 =(hex_char((y_pos[3]) >>  8));
uart_TX[0x37] = t1;
t2 =(hex_char((y_pos[3]) >>  4));    
uart_TX[0x38] = t2;
t3 =(hex_char((y_pos[3]) >>  0));    
uart_TX[0x39] = t3;
uart_TX[0x3a] = 0x2c;
//TFT_Draw_Char(10,90,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,10,90);
//TFT_Draw_Char(30,90,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,30,90);
//TFT_Draw_Char(50,90,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,50,90);
//TFT_Draw_Char(70,90,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);     
GUI_DispCharAt(t3,70,90);
t0 =(hex_char((x_pos[3]) >> 12));
uart_TX[0x3b] = t0;
t1 =(hex_char((x_pos[3]) >>  8));
uart_TX[0x3c] = t1;
t2 =(hex_char((x_pos[3]) >>  4));    
uart_TX[0x3d] = t2;
t3 =(hex_char((x_pos[3]) >>  0));    
uart_TX[0x3e] = t3;
uart_TX[0x3f] = 0x2c;
//TFT_Draw_Char(110,90,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,110,90);
//TFT_Draw_Char(130,90,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,130,90);
//TFT_Draw_Char(150,90,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,150,90);
//TFT_Draw_Char(170,90,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);
GUI_DispCharAt(t3,170,90);
//
event_flag[3] = touch_receive[0x15];
touch_id[3] = touch_receive[0x17];
t0 =(hex_char((event_flag[3]) >> 6));
uart_TX[0x40] = t0;
t1 =(hex_char((touch_id[3]) >>  4));   
uart_TX[0x41] = t1;
uart_TX[0x42] = 0x2c;
//TFT_Draw_Char(270,90,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,270,90);
//TFT_Draw_Char(370,90,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,370,90);
//----------------------------------------------------------------

t0 =(hex_char((y_pos[4]) >> 12));
uart_TX[0x43] = t0;
t1 =(hex_char((y_pos[4]) >>  8));
uart_TX[0x44] = t1;
t2 =(hex_char((y_pos[4]) >>  4));    
uart_TX[0x45] = t2;
t3 =(hex_char((y_pos[4]) >>  0));    
uart_TX[0x46] = t3;
uart_TX[0x47] = 0x2c;
//TFT_Draw_Char(10,110,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,10,110);
//TFT_Draw_Char(30,110,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,30,110);
//TFT_Draw_Char(50,110,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,50,110);
//TFT_Draw_Char(70,110,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2);     
GUI_DispCharAt(t3,70,110);
t0 =(hex_char((x_pos[4]) >> 12));
uart_TX[0x48] = t0;
t1 =(hex_char((x_pos[4]) >>  8));
uart_TX[0x49] = t1;
t2 =(hex_char((x_pos[4]) >>  4));    
uart_TX[0x4a] = t2;
t3 =(hex_char((x_pos[4]) >>  0));    
uart_TX[0x4b] = t3;
uart_TX[0x4c] = 0x2c;
//TFT_Draw_Char(110,110,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,110,110);
//TFT_Draw_Char(130,110,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,130,110);
//TFT_Draw_Char(150,110,WHITE,BLACK,(const uint8_t*) font8x8, t2 ,2);    
GUI_DispCharAt(t2,150,110);
//TFT_Draw_Char(170,110,WHITE,BLACK,(const uint8_t*) font8x8, t3 ,2); 
GUI_DispCharAt(t3,170,110);
//
event_flag[4] = touch_receive[0x1b];
touch_id[4] = touch_receive[0x1d];
t0 =(hex_char((event_flag[4]) >> 6));
uart_TX[0x4d] = t0;
t1 =(hex_char((touch_id[4]) >>  4));   
uart_TX[0x4e] = t1;
uart_TX[0x4f] = 0x2c;
//TFT_Draw_Char(270,110,WHITE,BLACK,(const uint8_t*) font8x8, t0 ,2);
GUI_DispCharAt(t0,270,110);
//TFT_Draw_Char(370,110,WHITE,BLACK,(const uint8_t*) font8x8, t1 ,2);
GUI_DispCharAt(t1,370,110);
//----------------------------------------------------------------
//GUI_GotoXY(100,100);    
//GUI_DispChar(t0); 
//GUI_GotoXY(120,100);     
//GUI_DispChar(t1);     
//GUI_GotoXY(140,100);    
//GUI_DispChar(t2); 
//GUI_GotoXY(160,100);     
//GUI_DispChar(t3);        
uart_TX[0x50] = 0x0d;
uart_TX[0x51] = 0x0a;
   if((x_circle_position[0] < 10 ) && (y_circle_position[0] < 10)){
//  Lcd_ClearScreen(BLACK);      
	GUI_Clear();		 
  }
   else{
//TFT_Draw_Circle(y_circle_position[0], x_circle_position[0], 5);     
GUI_DrawCircle(y_circle_position[0], x_circle_position[0], 5);    		 

///////**
//////  * @brief  Sends an amount of data in non blocking mode. 
//////  * @param  huart: pointer to a UART_HandleTypeDef structure that contains
//////  *                the configuration information for the specified UART module.
//////  * @param  pData: Pointer to data buffer
//////  * @param  Size: Amount of data to be sent
//////  * @retval HAL status
//////  */
//////HAL_StatusTypeDef HAL_UART_Transmit_DMA(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size)     
//HAL_UART_Transmit_DMA(&huart2, touch_receive, 0x20);
     

