golf2109/STM32F746IG-StemWin-800x480/Src/main.c
/////////**
////////* @brief  Starts the DMA Transfer.
////////* @param  hdma      : pointer to a DMA_HandleTypeDef structure that contains
////////*                     the configuration information for the specified DMA Stream.
////////* @param  SrcAddress: The source memory Buffer address
////////* @param  DstAddress: The destination memory Buffer address
////////* @param  DataLength: The length of data to be transferred from source to destination
////////* @retval HAL status
////////*/
////////HAL_StatusTypeDef HAL_DMA_Start(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)     
////HAL_DMA_Start(&hdma_usart2_tx, touch_receive, huart2, 0x20)    
   }
////////MasterTX[0]=0x00;
////////MasterTX[1]=0x01;
////////MasterTX[2]=0x02;
////////MasterTX[3]=0x03;    
//////////touch_adr = HAL_I2C_Master_Receive(&hi2c1, 0x6e, touch_receive, 0x03, 1);   
//////////HAL_Delay(1);    
////////touch_adr = HAL_I2C_Master_Transmit(&hi2c1, 0x70, MasterTX, 0x01, 1);   
//////////HAL_Delay(1);   
//////////for(uint8_t ttt=0; ttt<0x1F;ttt++){
////////touch_adr = HAL_I2C_Master_Receive(&hi2c1, 0x71, touch_receive, 0x30, 1);   
////////HAL_Delay(10);      
//HAL_UART_Transmit_DMA(&huart2, uart_TX, 0x52);   
touch_enable = 0;   
 }
}


int GUI_TOUCH_GetState_my(GUI_PID_STATE * pState){
	
if(touch_enable ==1){
  
//////////device_mode = touch_receive[0x00]; 
//////////gesture_id = touch_receive[0x01];
//////////number_of_tuchpoint = touch_receive[0x02];    
 
pState->x = 800*(256*(0x0F & (touch_receive[0x03])) + touch_receive[0x04])/1791;
pState->y = 480*(256*(0x0F & (touch_receive[0x05])) + touch_receive[0x06])/1024;	
//pState->Pressed = 1;
//touch_enable = 0; 	
return 1;

}	
pState->Pressed = 0;
return 0;
}

void GUI_TOUCH_Exec (void) {
  //TOUCH_STATE touch_state;
//	GUI_PID_STATE touch_state;
  static U8   PressedOld = 0;
  static int  xOld = 0;
  static int  yOld = 0;
         int  x, y;
         int  xDiff, yDiff;
//////////         int  xSize, ySize;
  GUI_TOUCH_GetState_my(&touch_state);
//  if (touch_state.Pressed) {
  if (touch_enable == 1) {	
    // Touch screen is pressed
    y=480*(256*(0x0F & (touch_receive[0x05])) + touch_receive[0x06])/1024;	
		x=800*(256*(0x0F & (touch_receive[0x03])) + touch_receive[0x04])/1791;
		
    if (PressedOld == 1) {
      // Touch screen has already been pressed
      // Calculate difference between new and old position
      xDiff = (x > xOld) ? (x - xOld) : (xOld - x);
      yDiff = (y > yOld) ? (y - yOld) : (yOld - y);
      // Store state if new position differs significantly
      if (xDiff + yDiff > 2) {
				touch_state.x = x;
				touch_state.y = y;				
				touch_state.Layer = 0;	
				touch_state.Pressed = 1;				
        GUI_TOUCH_StoreStateEx(&touch_state);
        xOld = x;
        yOld = y;
      }
    }
    else {
      // Touch screen was previously not pressed
      // Store state regardless of position
				touch_state.x = x;
				touch_state.y = y;				
				touch_state.Layer = 0;				
				touch_state.Pressed = 1;			
      GUI_TOUCH_StoreStateEx(&touch_state);
      xOld = x;
      yOld = y;
      PressedOld = 1;
    }
	touch_enable = 0; 			
  }
  else {
    // Touch screen is not pressed
    // Store state if it was released recently
    if (PressedOld == 1) {
      PressedOld = 0;
				touch_state.x = -1;
				touch_state.y = -1;				
				touch_state.Layer = 0;	
				touch_state.Pressed = 0;
      GUI_TOUCH_StoreStateEx(&touch_state);
    }
  }
}
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration----------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache-------------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache-------------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FMC_Init();
  MX_DMA2D_Init();
  MX_CRC_Init();
  MX_LTDC_Init();
  MX_SDMMC1_SD_Init();
  MX_FATFS_Init();
  MX_I2C1_Init();
  MX_TIM6_Init();
  MX_RNG_Init();
  MX_USART1_UART_Init();

  /* USER CODE BEGIN 2 */
	
//===================================================================================
HAL_SDRAM_MspInit(&hsdram1);
	
  /* SDRAM initialization sequence */
//  __HAL_RCC_DMA2D_CLK_ENABLE();   	
	
	SDRAM_Setting();

//=====================================================================

  HAL_LTDC_ProgramLineEvent(&hltdc, 0);
    /* Enable dithering */
  HAL_LTDC_EnableDither(&hltdc);
	
//	Touch_Ini();//narod_stream		

MasterTX[0]=0x80;
//----------------- reg N     real  datasheet
MasterTX[0x01]=0x25;//0x80    0x25    0x46   valid touching detect threshold
MasterTX[0x02]=0x3c;//0x81    0x3c    0x3c   valid touching peak detect threshold
MasterTX[0x03]=0xc6;//0x82    0xc6    0x10   threshold when calculating the focus of touching
MasterTX[0x04]=0x00;//0x83    0x00    0x3c   threshold when there is surface water
MasterTX[0x05]=0x06;//0x84    0x06    0x0a   threshold of temperature compensation
MasterTX[0x06]=0xa0;//0x85    0xa0    0x14   threshold whether the coordinate is different from the original
MasterTX[0x07]=0x01;//0x86    0x01    0x01   run mode of microcontroller controlled by host Power control  
MasterTX[0x08]=0x0a;//0x87    0x0a    0x02   time delay value when entering monitor status
MasterTX[0x09]=0x06;//0x88    0x06    0x0c   period of active status, it should not less than 12 Period Active[3:0]
MasterTX[0x0a]=0x28;//0x89    0x28    0x28   period of monitor status, it should not less than 30.
//MasterTX[0x0b]=0x6f;//0x8a
//MasterTX[0x0c]=0x4a;//0x8b
//MasterTX[0x0d]=0xeb;//0x8c
//MasterTX[0x0e]=0x69;//0x8d

touch_adr = HAL_I2C_Master_Transmit(&hi2c1, 0x70, MasterTX, 0x0b, 1); 
MasterTX[0]=0x80;
touch_adr = HAL_I2C_Master_Transmit(&hi2c1, 0x70, MasterTX, 0x01, 1);   
touch_adr = HAL_I2C_Master_Receive(&hi2c1, 0x70, test_read, 0x0a, 1);  

//=====================================================================
	/* Init the STemWin GUI Library */
	GUI_Init();

